{"data":{"site":{"siteMetadata":{"title":"BLOG","author":"Vinh Le"}},"markdownRemark":{"id":"fd3b2a07-7b3d-5ed1-ade2-81f8df03c2ac","excerpt":"This is the introduction part of my tutorial to build a REST API from scratch. If you want to skip this and dive right in coding, click  Here  to jump straight…","html":"<p>This is the introduction part of my tutorial to build a REST API from scratch. If you want to skip this and dive right in coding, click <a href=\"../rest-api-postgres-part-2\">Here</a> to jump straight to the second part. If you have few minutes for a brief intro, let’s continue from here.</p>\n<h3>Why Back-end matters</h3>\n<p>No matter where you are now in your career, if you are a web developer, then learn how the server side works is necessary. Not only this could potentially shift your career to full-stack, which also brings more opportunities and appreciation, but also gives you a more holistic view on how everything on the web works together, front-to-back.</p>\n<p>I started my career as a Front-end React developer. Gradually, I started realising the need of broadening my horizon to back-end field. Therefore, I began to spend more time learning server side codes.</p>\n<h3>How I started</h3>\n<p>Since I started learning how to code, my favorite method to approach new knowledge has always been through online courses. Nonetheless, my timetable does not allow me to follow sophisticated and occasionally  lengthy tutorial series on time being. Thus, I made a move to seek for guidelines in written form, either blog posts or GitHub repos, to quickly jump into it. The process was quite challenging sometimes as I gotta go to find solutions for problems and bugs without immediate answers from instructors. Nonetheless, after overcoming frustration, mostly from the beginning, I gradually grasp concepts and practices.</p>\n<p>And here we are today. Let me show you how to build a RESTful API with ExpressJS</p>\n<h2>What could you take away from this tutorial?</h2>\n<p>✅ Build a RESTful API with <strong>NodeJS</strong> and <strong>Express</strong> as the framework</p>\n<p>✅ Database management system? For sure, with <strong>PostgreSQL</strong></p>\n<p>✅ <strong>ORM</strong> for <strong>Postgres</strong>? <strong>Sequelize</strong> included!</p>\n<p>✅ <strong>Authentication</strong>? <strong>Passport</strong> and <strong>JWT</strong> checked!</p>\n<p>At the end of this tutorial, you can find a GitHub repo containing all mentioned code. So, let’s <a href=\"../rest-api-postgres-part-2\">dive in</a> and have fun!</p>","frontmatter":{"title":"Build a REST API from scratch - Part 1: The context","date":"February 22, 2019"}}},"pageContext":{"slug":"/rest-api-postgres-part-1/","previous":{"fields":{"slug":"/mooc/"},"frontmatter":{"title":"So you’ve signed up for another online course — how do you make the most of it?"}},"next":{"fields":{"slug":"/rest-api-postgres-part-2/"},"frontmatter":{"title":"Build a REST API from scratch - Part 2: Building!"}}}}