{"data":{"site":{"siteMetadata":{"title":"BLOG","author":"Vinh Le"}},"markdownRemark":{"id":"109906c8-d230-51be-bfa5-183647577b8c","excerpt":"Last year, I fortunately got the chance to read a special report in the Economist that discussed how important life-long learning is in the age of automation…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/2beb558979a88e278b75b4c3e34b3833/30631/headline.jpeg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 50%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAKABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAIFAQT/xAAWAQEBAQAAAAAAAAAAAAAAAAACAQT/2gAMAwEAAhADEAAAAXzjV5aBNIv/xAAZEAEAAgMAAAAAAAAAAAAAAAABADEREjL/2gAIAQEAAQUCzNgRjy21/8QAFREBAQAAAAAAAAAAAAAAAAAAAQD/2gAIAQMBAT8BCBv/xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/AT//xAAbEAACAQUAAAAAAAAAAAAAAAAAAXECAxAxkf/aAAgBAQAGPwLG1wuSMpg//8QAHBABAAICAwEAAAAAAAAAAAAAAQAhETFBcYGh/9oACAEBAAE/IcApviOQNQA1dw/Ck+cjg//aAAwDAQACAAMAAAAQgC//xAAaEQACAgMAAAAAAAAAAAAAAAAAEQEhcdHw/9oACAEDAQE/EGdjYhUn/8QAFREBAQAAAAAAAAAAAAAAAAAAACH/2gAIAQIBAT8QR//EAB0QAQACAgIDAAAAAAAAAAAAAAEAESFRMZFxgaH/2gAIAQEAAT8QtrhpFmEthGnv3AZacoKnZGHFELa8Rqa4KzXERS20r9n/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"learning\"\n        title=\"\"\n        src=\"/static/2beb558979a88e278b75b4c3e34b3833/f8fb9/headline.jpeg\"\n        srcset=\"/static/2beb558979a88e278b75b4c3e34b3833/e8976/headline.jpeg 148w,\n/static/2beb558979a88e278b75b4c3e34b3833/63df2/headline.jpeg 295w,\n/static/2beb558979a88e278b75b4c3e34b3833/f8fb9/headline.jpeg 590w,\n/static/2beb558979a88e278b75b4c3e34b3833/85e3d/headline.jpeg 885w,\n/static/2beb558979a88e278b75b4c3e34b3833/d1924/headline.jpeg 1180w,\n/static/2beb558979a88e278b75b4c3e34b3833/30631/headline.jpeg 1600w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>Last year, I fortunately got the chance to read a special report in the Economist that discussed how important life-long learning is in the age of automation. At this point in time, everyone seems to be afraid of the notion that AI and machines might ultimately replace their jobs. But the Economist argues for the significance of self-learning and self-development in general.</p>\n<p>One valuable source for self-learning is MOOCs (Massive Online Learning Courses), which are gaining incredibly widespread awareness. Thanks to their flexibility, availability, and increasingly affordable pricing, many people have found MOOCs to be an important tool to either refresh their skillset or pursue a career move.</p>\n<h3>How about the developers out there?</h3>\n<p>No matter whether you’re a newbie or a seasoned developer, you probably have gone through several online tutorials. In this article, I will not discuss the importance of MOOCs, as this has been covered widely. Rather, I’ll share my personal experience as a self-taught developer who has attended a few MOOCs and show you how to get the most out of them.</p>\n<h2>How to get the most out of a MOOC</h2>\n<h3>Please, don’t memorize those code blocks</h3>\n<p>There’s a very common mistake that you may have heard of a million times, and that I saw myself making when I first started diving into tutorials: I thought I could somehow memorize the lines of code I was working with.</p>\n<p>Soon, I realized that this not only take tons of time but also overwhelms and prevents you from moving forward. Let me show you why.</p>\n<p>Almost everything you see instructors doing on the screen will move in to your short-term memory. No matter how thoroughly you grasp the concept at the time, if you do not practice it frequently, it’s never going to sink in deeply inside your memory.</p>\n<p>It’s just how the human mind works. In order to quickly pick up something to use instantly when needed, we need to practice it frequently ourselves, and not just watch somebody doing it.</p>\n<p>Not being able to memorize code snippets you see might negatively affect your self-esteem at first. However, if you look at the bigger picture and analyze how much you’ll need to learn, you’ll realize that it’s not necessary to try to remember every bit of syntax or snippet.</p>\n<p>Don’t get me wrong. There are things that you absolutely have to remember. You’ll be heavily using them, and it will save you time later on. However, the point is, almost everything is searchable. You could quickly find those code blocks later on, so all you need to remember is what it is used for so that you know what to search for.</p>\n<p>Hence, deciding what you need to remember is pretty imporatnt, but it’s easier said than done. Remember, your time and mental capacity is limited. Save your brain cells for more important things.</p>\n<p>But what are those <strong>important</strong> things? Let’s move on.</p>\n<h3>Do try to grasp the concepts</h3>\n<p>Yep, concepts are important. But, again, which concepts?</p>\n<p>If you consider the functionality of a code block, it basically tells you how to solve a given problem. However, understanding why it does that is far more critical. In other words, taking into account what’s happening behind the scenes, and figuring out how the concepts connect the dots together to solve an issue.</p>\n<p>The further you go into your coding journey, the more you’d realize that the lines of code you write are just a way to solve the problem. And as we develop, the way to solve the problem is updated frequently and improved upon, but the concepts hardly change.</p>\n<p>Imagine that you want to use a certain library. You go to its documentation or scroll down to the usage part of its Github repo, grab that block of code, and paste it into your project. One month later, the syntax changes and red lines scrawl across your terminal. What are you going to do?</p>\n<p>Fortunately, it’s not that big a deal if you already understood the code snippet when you first used it. You’d know what the library was used for and what its dependencies were for it to work properly. As a result, the problem can quickly be solved right after a few searches.</p>\n<h3>Hey, but how is all this related to tutorials?</h3>\n<p>You probably know that not every instructor tries to carefully and thoroughly explain <strong>why</strong> they choose a particular technology or <strong>why</strong> their code just works, elegantly and somehow magically.</p>\n<p>The reason is, it really takes time and effort to painstakingly communicate all of this info over the course of a tutorial. Concerning how much time a course normally takes, and how much stuff they need to cover, sometimes instructors just can’t cover everything.</p>\n<h3>How can you sort this out?</h3>\n<p>One way is to <strong>pick a proper course.</strong> In one of my blogs, I discuss how filtering through learning resources is actually quite challenging. And that’s not because the sources are very limited — rather, there are tons of them and that may overwhelm you at first. So how do you choose the right resource?</p>\n<p>Luckily, almost all of the MOOC providers that I know offer a trial period in which you can preview a number of lectures within a course. The trial period may vary across providers. However, it is normally long enough for you to at least get a taste of the contents as well as the teaching methods of the instructor.</p>\n<p>Personally, after I sign up for a trial, I do not hurry up and dive straight into the course. Instead, I try to observe the way the instructor explains and clarifies concepts. The purpose of this is to make sure that after dedicating my time and money to a course, I will learn how to think and solve problems in my projects outside of the extent the tutorial covers.</p>\n<h3>Rating does matter, but not that much</h3>\n<p>One of the mistakes that I made at the beginning when selecting a course was relying heavily on the course rating, reviews, and the number of students enrolled.</p>\n<p>However, the fact is that not all instructors have a flair for explaining concepts, regardless of how brilliant they are. Teaching skills are not directly proportional to a person’s experience or skill level.</p>\n<p>Additionally, each learner’s sense of understanding and experience level is also different. Some people may find that an instructor explains concepts really well, but that may not be the case with you.</p>\n<p>Remember that you will follow the course you pick over a decent amount of time. Many of us might spend time after our day jobs studying, which is why this time is very valuable.</p>\n<p>You could be spending the time with your family or on your social life. However, you’re dedicating that time to developing yourself instead. As a result, a proper course not only needs to give you a better understanding and broaden your knowledge, but must also provide a sense of excitement. This will motivate you and keep you hungry to learn more, thereby keeping up your momentum.</p>\n<p>And, once you have the desire to learn, learning changes from being a responsibility (something that needs to be done) to a joy (something that you want to do). Does that sound better?</p>\n<h3>Look for other solutions</h3>\n<p>There’s a famous quote,</p>\n<blockquote>\n<p>A smooth sea never make the best sailor.</p>\n</blockquote>\n<p>Does this make sense?</p>\n<p>Not too obvious, is it? Let me tell you why.</p>\n<p>Have you ever thought that while you’re in the middle of a tutorial, everything works just flawlessly like it’s magic?</p>\n<p>In my opinion, the reason is that, in a project that an instructor chooses to teach you, they’ve already picked a technology that they know about best, and they’ve also rehearsed it and tried it out in practice many times.</p>\n<p>However, there is never a single way to solve a problem. Alternatives always exist, especially in the tech world. Therefore, whenever possible, try to investigate other ways to solve a particular problem. This might sound time-consuming and vague at first. But, later on when you work on your personal project, and you’re all on your own, you’ll realize the benefit of this habit. Trust me, it’ll really help you in the long run.</p>\n<p>You must not only look into altervatives to solve a problem, but also come across the solution itself by asking questions such as:</p>\n<ul>\n<li>Why is this technology is the best way to solve that particular issue?</li>\n<li>What makes it superior to others in that context?</li>\n</ul>\n<p>Every time the instructor suggests a solution, you are aware of why it solves the problem, and don’t just understand it for the sake of it. The distance between getting to know something and truly grasping it is far more than just listening to the explanation.</p>\n<h3>How? Read about it!</h3>\n<p>So how do you find out a solution to a concept that is brand new to you? Spending time on different mediums is a great way to help. Video is useful to follow along and get a sense of of the breadth of a concept. But I’ve found that articles and blogs are also imperative to understanding a concept in depth.</p>\n<p>One more thing: never discount the official documentation, my friends. It is the one of the most important resources for understanding a concept and the one that you will most likely come back to later on.</p>\n<p>But, reading documentation can be sort of overwhelming, especially for code newbies.</p>\n<p>Nonetheless, the point is you do not need to read the whole thing. Rather, try to just view the part where it solves the problem that you are facing right now. Read through it, compare it with how your instructor presented it, and google how other users implement it. Trust me, you will get much deeper into a library, technology, or concept.</p>\n<h3>Documenting instead of copying</h3>\n<p>What if I told you that you will forget a majority of what you have just learned in the next couple of weeks or months?</p>\n<p>I am hardly able to fully recall a thing I worked on and understood fully just a few weeks ago.</p>\n<p>As mentioned above, the truth is painful my friends. Our brain and memory capability is limited. You’ll not recall something soon after you learn it, unless you practice it frequently. Compounded by the vast amount of knowledge you need to learn and understand, it is pretty normal if one day when you’re working on your own project and face a problem and tell yourself:</p>\n<blockquote>\n<p>I definitely have seen it, listened to it, thought that I understood how to solve it, but why the heck can’t I recall it right now?</p>\n</blockquote>\n<p>If it is a concept, or a library, then you can quickly solve this by researching or looking at the documentation. However, this problem gets worse if it is a particular issue that the documentation does <strong>not</strong> cover.</p>\n<p>Of course, you could then continue to search and hope that other folks already went through these problems and sought solutions online as well. But let’s admit that this is not really efficient and time-saving, right?</p>\n<p>That’s how the <strong>other</strong> documentation comes into place. I’m not talking of the official documentation, but <strong>your</strong> documentation.</p>\n<p>What? Yes, you’ve got to maintain your own documentation, too.</p>\n<p>How? By practicing the habit of writing down what you have learned and saving it somewhere so that you can quickly refer to it when needed.</p>\n<p>More importantly, please do not treat it only as your dictionary of syntax and snippets! Fill it up with problem analysis, thoughts, in-depth clarification, references from different sources. Make it yours so that you know how to access the information quickly.</p>\n<h3>Don’t forget the forums and discussion boards</h3>\n<p>What do you usually do when you run into bugs or problems during a tutorial?</p>\n<p>Do you Google/ StackOverFlow on your first attempt?</p>\n<p>What if I told you that you’ve already got a mini version of StackOverFlow right inside your tutorial?</p>\n<p>Yep. That’s how forum and discussion panels are designed within courses. And most online courses offer a place for students to discuss their problems with the instructor or their peers.</p>\n<p>The course forums and discussion boards are usually the first place that I go when I run into bugs — even before I begin Googling them. That’s because many students doing the course have already come across the same bug. Therefore, you might find answers right in the Q&#x26;A section without leaving the class.</p>\n<p>Another way you can use the forum is to share your solutions with others. It could be an elegant piece of code that no one has shared, or even some parts of the solution given by the lecturer that you found vague. Either way, sharing your solutions helps you reinforce your concepts and improve your knowledge. It also provides you with an opportunity to learn not only from your instructor, but also from your peers.</p>\n<h3>Beware - Don’t let these courses fool you!</h3>\n<p>What do you usually do when you run into bugs or problems during a tutorial?</p>\n<p>Do you Google/ StackOverFlow on your first attempt?</p>\n<p>What if I told you that you’ve already got a mini version of StackOverFlow right inside your tutorial?</p>\n<p>Yep. That’s how forum and discussion panels are designed within courses. And most online courses offer a place for students to discuss their problems with the instructor or their peers.</p>\n<p>The course forums and discussion boards are usually the first place that I go when I run into bugs — even before I begin Googling them. That’s because many students doing the course have already come across the same bug. Therefore, you might find answers right in the Q&#x26;A section without leaving the class.</p>\n<p>Another way you can use the forum is to share your solutions with others. It could be an elegant piece of code that no one has shared, or even some parts of the solution given by the lecturer that you found vague. Either way, sharing your solutions helps you reinforce your concepts and improve your knowledge. It also provides you with an opportunity to learn not only from your instructor, but also from your peers.</p>\n<p>Beware - Don’t let these courses fool you!\nThere is one issue with online courses that I found myself running into many times. To be frank, I was under the illusion that I was a great problem solver based on the progress I achieved throughout a course.</p>\n<p>But, then I realized that the answers I thought I had learned were not actually my solutions! They belonged to the instructor and were right inside the course.</p>\n<p>That’s because every time a real life problem needs to be solved, no one except you must go to find the answer. There are no suggestions from the instructor, no recommendations or hints from your fellow learners. Only you and the knowledge that you have obtained. That is the moment when you truly recognize what knowledge you have and what you don’t!</p>\n<p>But once again, you absolutely should not blame yourself for this. The first step is just accepting the truth, and then figuring out how to sort it out.</p>\n<p>When you’re not actively (and independently) solving a problem and get used to waiting for other’s suggestions, your critical thinking skills will gradually weaken. As a result, when you’re following along with a tutorial and face a problem, why don’t you pause the video and give yourself some time to try out various solutions?</p>\n<p>The idea is not only to ultimately look for the answer, but also to develop a critical mindset. Once you find the answer yourself without the help of others, regardless of whether your solution is perfect or your method is elegant, you’ve already gained something for yourself. And that mindset will become your habit and help you solve bigger problems later on.</p>\n<p>You might say, what if it is a technology, library, or framework that I haven’t heard of before? What if there is no way for me to get a sense of using it?</p>\n<p>No problem, my friends. Just bear in mind that you are going through those tutorials to get to know and learn new things. However, to get the most out of them, and to make them yours afterwards, try not to follow and imitate your instructor step-by-step.</p>\n<p>If it is a technology that you’re not familiar with, try to have a look at its documentation or at least Google it after being enlightened by the lecturer. After that, give yourself the courage to try to understand it and give it a shot. Even if it might break at the first attempt, you are absolutely fine.</p>\n<p>Remember, the more struggles and difficulties you face along the way, the more likely you are to remember and make the knowledge yours.</p>\n<h2>Conclusion</h2>\n<p>As newbies, many of us are fearful of making mistakes and getting lost. This really prevents us from getting out of our comfort zones, and we find ourselves trapped and unable to approach a problem.</p>\n<p>Therefore, let’s take courage my friends! Your code could be ugly or broken at first, but it is still better than copying lines written by others.</p>\n<p>There is a common cycle, <strong>Try, Test, Learn, and Improve,</strong> that many use when approaching a new concept. And as you saw, learning and improving are just the two later parts. They are the steps to polish your knowledge. They are important.</p>\n<p>But it is even more essential to get a taste of that new thing on your own, and try it out to see how it is right, or wrong. Then continue to figure out the problems along the way until it somehow works. The more independent you are in your learning, the more happy and excited you might feel when the problem is solved!</p>\n<p>Nonetheless, this is a process that every one of us must go through. And life is so boring without any changes or development, isn’t it? So, how do you make the most of your learning path? Disrupt your conventional ways of approaching problems, prioritize broad concepts over actual syntax, document your journey, and leverage resources provided by courses. You will absolutely be on the right track!</p>","frontmatter":{"title":"So you’ve signed up for another online course — how do you make the most of it?","date":"July 13, 2018"}}},"pageContext":{"slug":"/mooc/","previous":{"fields":{"slug":"/developer/"},"frontmatter":{"title":"Wanna be a developer? Here is what you need to take into account."}},"next":{"fields":{"slug":"/rest-api-postgres-part-1/"},"frontmatter":{"title":"Build a REST API from scratch - Part 1: The context"}}}}